//#include<stdio.h>
//
////回顾一下for while do while 
////for( ; ; ) 初始化  循环的条件  当此循环结束会执行的语句
//// ;最终要的就是这个；
////
//int main()
//{
//	//int a = 1;
//	//while (a++ <= 1)
//	//{
//	//	while (a++ <= 2);
//	//	//
//	//}
//	//	
//	//printf("%d\n", a);
//	//5
//	/*首先a是等于1的
//	a++ <= 1 判断完之后a是等于2的
//	a++ <= 2 判断完之后a变成了3的
//	a++ <= 2 此时a是等于4的
//	a++ <= 1 此时a等于5*/
//
//	//逻辑终止
//	//在或条件下 从左往右看 只要有一个为一的表达式，那么后面的表达式将不会被判断和执行
//	//在与条件下 从左往右看 只要有一个为0的表达式，那么后面的表达式将不会被判断和执行
//	/*for (int i = 1; 1 >= 2 && i <= 100 ; i++)
//	{
//
//	}*/
//
//	/*int i = 100 , j;*/
//	//c语言 当中的“真”与“假” 
//	//非0 为真 0 为假
//	//逻辑终止的事情，考试比较“阴险”和麻烦的
//	//for ( i = 1 ; i <= 100 ; i++);
//
//	//先do里面的然后再判断while里面的表达式
//	//do
//	//{
//
//	//} while (1);// 不要忘记这个分号
//	//int i = 1;
//	////case 后面一般是数字或者是枚举类
//	//switch (i)
//	//{
//	//case 1: printf("1\n");
//	//	//break;
//	//case 2:
//	//	printf("2\n");
//	//	break;
//	//default:
//	//	printf("default\n");
//	//	break;
//	//}
//
//	//二分算法
//	//在一个有序的数组里面查找一个值？
//	//猜数字游戏
//
//	return 0;
//}

