//#include<stdio.h>
//
//int main()
//{
//	// 0000 0000 0000 0000 0000 0000 0000 0001 num1 = 1;
//	// 0000 0000 0000 0000 0000 0000 0000 0010 num2 = 2;
//	// 0000 0000 0000 0000 0000 0000 0000 0000 num1 & num2 = 0
//	// 0000 0000 0000 0000 0000 0000 0000 0011 num1 | num2 = 3
//	// 0000 0000 0000 0000 0000 0000 0000 0011 num1 ^ num2 = 3
//	// 异或的一些性质
//	// 0律 0 ^ a = a
//	// a ^ a = 0
//	// & 同时为真则为真
//	// | 有一个为真则为真
//	// ^ a + b = 1。
//	//两个通过位运算来解决的问题
//	//在二进制情况下有多少个1
//	//对于正数
//	/*int num = 100;a
//	while (num)
//	{
//		int t = num % 2;
//		num /= 2;
//	}*/
//	//通过位运算的代码
//	
//	//0000 0000 0000 0000 0000 0000 0000 0011
//	//0000 0000 0000 0000 0000 0000 0000 0000
//	//0000 0000 0000 0000 0000 0000 0000 0001
//	//右移一位
//	//0000 0000 0000 0000 0000 0000 0000 0001
//
//	//如果我想要不断的输入数字然后输出ta的二进制
//	/*int num;
//	while (scanf_s("%d", &num) != EOF)
//	{
//		for (int i = 31; i >= 0; i--)
//		{
//			if (num >> i & 1) printf("1");
//			else printf("0");
//		}
//		printf("\n");
//	}*/
//	//把非0的变成0把0变成1
//	/*printf("%d\n", 2);
//	printf("%d\n", !2);
//	printf("%d\n", 0);
//	printf("%d\n", !0);*/
//	//int 
//	//long long 
//	/*double i = 2.1;
//	printf("%d\n", (int)i);*/
//	//printf("%d\n", 1 == 2);//0
//	//printf("%d\n", 1 != 2);//1
//	//int i = 0;
//	//1 || (i += 1);
//	//0 && (i += 1);
//	//printf("%d\n", i);
//	//i = 0;
//	////printf("%d", (i += 1) && 0);
//	//printf("%d\n", i);
//
//	/*int a = 1, b;
//	if (a > 5)
//		b = 3;
//	else
//		b = -3;*/
//	//(a > 5) ? 3 : -3;
//	NULL;
//	return 0;
//}